# IFC_DMSaveSettings

## Description
Saves the IFC Data Mapping.

```pascal
FUNCTION IFC_DMSaveSettings(
				inStrParam    : STRING;
				inObjName     : STRING;
				bFileSettings : BOOLEAN) : BOOLEAN;
```

```python

def vs.IFC_DMSaveSettings(inStrParam, inObjName, bFileSettings):
    return BOOLEAN
```

## Parameters
|Name|Type|Description|
|---|---|---|
|inStrParam|STRING||
|inObjName|STRING||
|bFileSettings|BOOLEAN||

## Version
Availability: from Vectorworks 2017
## Category
* IFC